ggoals_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MgaNa27sbLsZbbFhLzkScg"], ["updated_at", "2019-03-05 02:25:52.033252"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = self.class.create_session_token
    self.save!