music_app/app/views/albums/_form.html.erb

  <label>
    <% Album::KIND.each do |kind| %>
---
SELECT "albums".* FROM "albums"