ninety_nine_cents/app/controllers/cats_controller.rb

  def update

    @cat = Cat.find_by(id: params[:id])
    # fail
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Puffy2"], ["description", "    Soft and fluffy pretty kitten!\r\n  "], ["updated_at", "2019-02-21 02:59:40.143107"], ["id", 5]]