music_app/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    #/albums/:id
    @album = Album.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."band_id" = $1 LIMIT $2  [["band_id", "4"], ["LIMIT", 1]]
---
  def new
    #/bands/:band_id/albums/new
    @band = Band.find_by(id: params[:band_id])
    @album = Album.new
    @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Innuendo"], ["year", "1991"], ["band_id", 4], ["created_at", "2019-02-28 21:57:40.861898"], ["updated_at", "2019-02-28 21:57:40.861898"]]
---
  def create
    # POST:  /albums
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 5]]
---
  def destroy
    # DELETE: /albums/:id
    @album = Album.find_by(id: params[:id])
    if @album.destroy