music_app/app/controllers/notes_controller.rb

  def create
    params[:note][:user_id] = current_user.id
    @note = Note.new(note_params)
    @note.save
---
INSERT INTO "notes" ("comment", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "  cool cool!"], ["user_id", 3], ["track_id", 1], ["created_at", "2019-03-01 03:37:51.480425"], ["updated_at", "2019-03-01 03:37:51.480425"]]

  def destroy
    @note = Note.find_by(id: params[:id])
    if current_user.id != @note.user_id
      render status: :forbidden, text: "You can't detroy this comment"
    else
      @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]