ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
  def index

    @cat_request = CatRentalRequest.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cat_request = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def approve
    @cat_request = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def deny
    @cat_request = CatRentalRequest.find_by(id: params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["end_date", "2019-02-28"], ["start_date", "2019-02-26"], ["status", "PENDING"], ["created_at", "2019-02-25 22:51:12.961255"], ["updated_at", "2019-02-25 22:51:12.961255"]]
---
  def create
    # render json: "ok"
    @cat_request = CatRentalRequest.new(cat_rental_request_params)
    # fail
    if @cat_request.save