ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

  def cat_owner_decision!
    rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def current_cat_rental_request
    @rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]