ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["sex", "M"], ["color", "white"], ["description", "    She's a funny girl!\r\n  "], ["updated_at", "2019-02-21 01:56:58.405891"], ["id", 1]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)