ninety_nine_cats/app/models/cat_rental_request.rb

  def deny!
    self.status = "DENIED"
    self.save
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-02-22 01:38:57.746559"], ["id", 4]]

  def approve!
    self.transaction do
      self.status = "APPROVED"
      self.save
      overlapping_pending_requests.each do |req|
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-02-22 00:23:59.443250"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2019-02-27' OR end_date < '2019-02-26') AND (status = 'PENDING')  [["id", 1], ["cat_id", 1]]

  def does_not_overlap_approved_request
    return if self.status == "DENIED"

    unless overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2019-02-22' OR end_date < '2019-02-13') AND (status= 'APPROVED') LIMIT $3  [["cat_id", 2], ["id", 3], ["LIMIT", 1]]

  def overlapping_approved_requests
    overlapping_requests.where("status= \'APPROVED\'")
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]

  def overlapping_requests
    CatRentalRequest.where(cat_id: self.cat_id)
      .where.not(id: self.id)
      .where.not("start_date > :end_date OR end_date < :start_date",
                start_date: self.start_date, end_date: self.end_date)
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]