ninety_nine_cats/app/models/cat_rental_request.rb

  def does_not_overlap_approved_request
    # A denied request doesn't need to be checked. A pending request
    # should be checked; users shouldn't be able to make requests for
    # periods during which a cat has already been spoken for.
    return if self.denied?

    unless overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" IS NOT NULL AND "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2019-02-28' OR end_date < '2019-02-26') AND (status = 'APPROVED') LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]