ninety_nine_cents/app/views/cat_rental_requests/_form.html.erb

  <select id="choose_cat" name="cat_rental_request[cat_id]">
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"