ninety_nine_cents/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-02-22 00:23:59.443250"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]
---
  def approve!
    self.transaction do
      self.status = "APPROVED"
      self.save
      p overlapping_pending_requests
      overlapping_pending_requests.each { |req| req.status = "DENIED" }

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 2]]
---
  def overlapping_requests
    cat_rentals = CatRentalRequest.where(cat_id: self.cat_id)
    res = []
    cat_rentals.each do |cat_rent|