URLShortener/app/models/shortenedurl.rb

SELECT  1 AS one FROM "shortenedurls" WHERE "shortenedurls"."short_url" = $1 LIMIT $2  [["short_url", "voimKVNPlhUPPBTRYr4QtA"], ["LIMIT", 1]]
---
  def self.random_code
    while(1)
      short = SecureRandom.urlsafe_base64
      break unless self.exists?(:short_url => short)

INSERT INTO "shortenedurls" ("user_id", "short_url", "long_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["short_url", "ENdvr1To6sVy3FlbwsIY_g"], ["long_url", "ajhcfa867"], ["created_at", "2019-02-09 00:32:06.239001"], ["updated_at", "2019-02-09 00:32:06.239001"]]
---
  def self.factory!(user, long_url)
    user_id = user.id
    short_url = self.random_code
    self.create!({:user_id => user_id, :short_url => short_url, :long_url => long_url})